In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('./Towed_Vehicles.csv')

In [5]:
df.head()

,Tow Date,Make,Style,Model,Color,Plate,State,Towed to Address,Tow Facility Phone,Inventory Number
0,12/03/2015,ACUR,4D,NaN,WHI,Y753941,IL,701 N. Sacramento,(773) 265-7605,6833043
1,12/03/2015,ACUR,4D,NaN,SIL,3266735,IL,701 N. Sacramento,(773) 265-7605,6833025
2,12/03/2015,ACUR,4D,NaN,GRY,A421860,IL,701 N. Sacramento,(773) 265-7605,6833027
3,12/03/2015,ACUR,4D,NaN,GRY,K511765,IL,701 N. Sacramento,(773) 265-7605,6833019
4,12/03/2015,ACUR,4D,NaN,BLK,4647389,IL,701 N. Sacramento,(773) 265-7605,6832991

## (A) In which states are most of the twoed vehicles registered? Explain why you think this is the case.

In [6]:
df.State.value_counts().head()

IL    4389
IN     109
WI      39
MN      21
MI      18
Name: State, dtype: int64

ANS: Illinois. This is because the data set is *Towed Vehicles in Chicago*, and Chicago is in Illinois.

## (B) Which vehicle(s) were towed the most during the period 9/04/2015 to 12/03/2015? List the license plates of these vehicles.

In [7]:
dfb = df[['Tow Date', 'Make', 'Plate']].dropna().sort_values(by=['Tow Date'])

In [8]:
dfb.head()

        Tow Date  Make    Plate
4773  09/04/2015  NISS  V775294
4768  09/04/2015  BUIC  P649382
4769  09/04/2015  CHEV  CJB4773
4772  09/04/2015  DODG  E702122
4771  09/04/2015  CHEV  Y729586

In [9]:
dfbp = dfb.Plate.value_counts().head(7)

ANS:

In [10]:
for plate in dfbp.index:
    print(plate)

Y765088
S954418
L851112
E437592
1448764B
S890142
E313465